INSERT IGNORE INTO topic (topic_name, category_name, subject_name) VALUES
('Числа і вирази', 'Алгебра і початки аналізу', 'Математика'),
('Дійсні числа', 'Алгебра і початки аналізу', 'Математика'),
('Відношення та пропорції. Відсотки. Текстові задачі', 'Алгебра і початки аналізу', 'Математика'),
('Показникові, логарифмічні, тригонометричні вирази та їхні перетворення', 'Алгебра і початки аналізу', 'Математика'),
('Раціональні, ірраціональні, степеневі вирази та їх перетворення', 'Алгебра і початки аналізу', 'Математика'),
('Рівняння, нерівності та їхні системи', 'Алгебра і початки аналізу', 'Математика'),
('Лінійні, квадратні, раціональні рівняння та системи рівнянь', 'Алгебра і початки аналізу', 'Математика'),
('Ірраціональні, тригонометричні рівняння та системи рівнянь', 'Алгебра і початки аналізу', 'Математика'),
('Показникові, логарифмічні рівняння та системи рівнянь', 'Алгебра і початки аналізу', 'Математика'),
('Нерівності та системи нерівностей', 'Алгебра і початки аналізу', 'Математика'),
('Розв’язування задач за допомогою рівнянь і систем рівнянь', 'Алгебра і початки аналізу', 'Математика'),
('Функції', 'Алгебра і початки аналізу', 'Математика'),
('Числові послідовності', 'Алгебра і початки аналізу', 'Математика'),
('Функціональна залежність', 'Алгебра і початки аналізу', 'Математика'),
('Лінійні та квадратні функції', 'Алгебра і початки аналізу', 'Математика'),
('Степеневі, показникові, логарифмічні та тригонометричні функції', 'Алгебра і початки аналізу', 'Математика'),
('Похідна функції', 'Алгебра і початки аналізу', 'Математика'),
('Первісна та визначений інтеграл', 'Алгебра і початки аналізу', 'Математика'),
('Комбінаторика, теорія ймовірностей, статистика', 'Алгебра і початки аналізу', 'Математика'),
('Перестановки, комбінації, розміщення. Комбінаторні правила суми та добутку', 'Алгебра і початки аналізу', 'Математика'),
('Ймовірність випадкової події. Вибіркові характеристики', 'Алгебра і початки аналізу', 'Математика');

INSERT IGNORE INTO topic (topic_name, category_name, subject_name) VALUES
('Планіметрія', 'Геометрія', 'Математика'),
('Елементарні геометричні фігури на площині. Геометричні величини', 'Геометрія', 'Математика'),
('Трикутники', 'Геометрія', 'Математика'),
('Прямокутні трикутники', 'Геометрія', 'Математика'),
('Паралелограм. Ромб. Трапеція', 'Геометрія', 'Математика'),
('Прямокутник. Квадрат', 'Геометрія', 'Математика'),
('Коло та круг. Многокутники', 'Геометрія', 'Математика'),
('Координати та вектори на площині. Геометричні переміщення', 'Геометрія', 'Математика'),
('Стереометрія', 'Геометрія', 'Математика'),
('Прямі та площини у просторі', 'Геометрія', 'Математика'),
('Призма', 'Геометрія', 'Математика'),
('Піраміда', 'Геометрія', 'Математика'),
('Тіла обертання', 'Геометрія', 'Математика'),
('Координати та вектори у просторі', 'Геометрія', 'Математика');

INSERT INTO question (question_id, question_text, optiona, optionb, optionc, optiond, optione, correct_answer, topic_id, explanation) VALUES
(1, 'Чому дорівнює квадратний корінь із 144?', '10', '12', '14', '16', '24', '12', 5, 'Квадратний корінь із числа 144 — це число, яке при множенні саме на себе дає 144. Це число — 12, оскільки 12 * 12 = 144.'),
(2, 'Яке число є простим?', '4', '6', '7', '8', '9', '7', 1, 'Просте число — це натуральне число, яке має рівно два різні натуральні дільники: 1 і саме себе. Серед наданих варіантів тільки 7 є простим числом, оскільки воно ділиться лише на 1 і 7.'),
(3, 'Що таке число Пі (π)?', 'Співвідношення довжини кола до його діаметра', 'Число, яке представляє собою суму всіх цілих чисел до 10', 'Висота трикутника', 'Площа круга', 'Невідома величина', 'Співвідношення довжини кола до його діаметра', 16, 'Число Пі (π) — це математична константа, що визначається як відношення довжини кола до його діаметра. Воно є ірраціональним числом, тобто його десяткове представлення ніколи не закінчується і не повторюється.'),
(4, 'Обчисліть: 5 + 3 * 2', '16', '11', '13', '10', '14', '11', 1, 'Згідно з порядком виконання арифметичних операцій (PEMDAS/BODMAS), множення виконується перед додаванням. Отже, спочатку обчислюємо 3 * 2 = 6, а потім додаємо 5: 5 + 6 = 11.'),
(5, 'Яке наступне число в послідовності Фібоначчі: 1, 1, 2, 3, 5, 8, ...?', '13', '10', '12', '15', '14', '13', 13, 'Це послідовність Фібоначчі, де кожне наступне число є сумою двох попередніх. Отже, 5 + 8 = 13.');

